<template>
  <view class="chat-list">
    <view-list :info-list="infoList"></view-list>
  </view>
</template>

<script lang="ts" setup>
  import { reactive } from 'vue';
  
  const infoList = reactive([
    {
      title: '标准名称',
    },
    {
      title: '标准名称',
      desc: '标准描述',
    },
    {
      title: '标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称标准名称',
      desc: '标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述标准描述',
    },
    {
      img: 'https://lmg.jj20.com/up/allimg/tp09/210F2130512J47-0-lp.jpg',
      title: '标准名称',
      desc: '标准描述',
      right: '右侧文本',
    },
    {
      img: 'https://lmg.jj20.com/up/allimg/tp09/210F2130512J47-0-lp.jpg',
      title: '标准名称',
      desc: '标准描述',
      right: {
        top: '顶部文本',
        bottom: '底部文本',
      },
    },
    {
      img: 'https://lmg.jj20.com/up/allimg/tp09/210F2130512J47-0-lp.jpg',
      title: '标准名称内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长',
      desc: '标准描述内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长',
      right: '底部文本内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长',
    },
    {
      img: 'https://lmg.jj20.com/up/allimg/tp09/210F2130512J47-0-lp.jpg',
      title: '标准名称内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长',
      desc: '标准描述内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长',
      right: {
        top: '顶部文本内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长',
        bottom: '底部文本内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长内容较长',
      },
    }
  ]);
  
</script>

<style>

</style>